SE.TruckTicketing/BillingService/Tests/SE.BillingService.Domain.Tests/TestData/invoice-delivery-request.json

{
  "Source": "D365FO",
  "SourceId": "e01346e5-369a-43cd-a408-318379c69b62",
  "MessageType": "InvoiceRequest",
  "Operation": "Update",
  "CorrelationId": "{6C5CB3FA-A800-42A9-8AA8-926F591CC202}",
  "MessageDate": "2022-07-20T14:41:11",
  "Blobs": [
    {
      "ContainerName": "invoice-delivery",
      "BlobPath": "attachments/test-with-images.pdf",
      "ContentType": "application/pdf",
      "Filename": "test-with-images.pdf"
    },
    {
      "ContainerName": "invoice-delivery",
      "BlobPath": "attachments/image.jpg",
      "ContentType": "image/jpeg",
      "Filename": "image.jpg"
    }
  ],
  "Payload": {
    "Platform": "OpenInvoice",
    "BillingCustomerId": "f37b7c90-c9a9-425c-88c3-06378f16562a",
    "InvoiceAccount": "C0065",
    "InvoiceId": "BCFST10000042-IP",
    "InvoiceDate": "2022-11-30T13:30:30Z",
    "DataAreaId": "MAEC",
    "EdiDate": "2022-11-30T13:30:30Z",
    "Email": "test@example.com",
    "CurrencyCode": "CAD",
    "InvoiceTotal": 182.87,
    "TotalLineItems": 1,
    "BillToDuns": "243826232",
    "RemitToDuns": "243483406",
    "Comments": "Attn: Shaun Wilson 100-02-14-026-19W3-00 Produced Water Disposal",
    "LineItems": [
      {
        "ItemNumber": "701001",
        "Description": "Landfill Disposal Class 2 - Drilling - Drilling waste-hydrocarbon",
        "Quantity": 15.5,
        "UnitsOfMeasure": "M3",
        "Rate": 10.99,
        "TaxStateProvince": "SK",
        "TaxCountry": "CA",
        "TaxAmount": 22.14,
        "Tax": [
          {
            "TypeCode": "GST",
            "Country": "CA",
            "Province": "SK",
            "Amount": 22.33,
            "Rate": 5.0,
            "Description": "Good and Services Tax",
            "TaxType": "GoodAndServices"
          }
        ],
        "DiscountAmount": 9.62,
        "DiscountPercent": 0.05,
        "TotalAmount": 182.87,
        "ServicePeriodEndLine": "2023-02-14T00:00:00Z",
        "ServicePeriodStartLine": "2023-02-14T00:00:00Z",
        "Edi": {
          "Account": "",
          "AccountQty": "",
          "AFE": "",
          "AFEOwner": "",
          "Alpha": "",
          "ApproverCoding": "",
          "AssetNumber": "",
          "Attnto": "",
          "AttnToName": "",
          "BuyerCode": "",
          "BuyerDepartmentDefault": "",
          "CatalogSerialNo": "",
          "CCType": "",
          "ChargeTo": "",
          "ChargeToName": "",
          "Company": "",
          "CompanyRep": "",
          "Contract": "",
          "ContractLineNumber": "",
          "CostCenter": "",
          "CostCenterName": "",
          "FieldLocation": "",
          "GLAccount": "",
          "Joints": "",
          "Location": "",
          "LocationComments": "",
          "MajorCode": "",
          "MatGrp": "",
          "MaterialCode": "",
          "MGDesc": "",
          "MinorCode": "",
          "NetworkActivity": "",
          "ObjSubna": "",
          "OPNumber": "",
          "OperationCat": "",
          "OperatorCoding": "",
          "OrderNumber": "",
          "POApprover": "",
          "POLine": "",
          "PONumber": "",
          "ProfitCentre": "",
          "Project": "",
          "ProjectPONo": "",
          "ReportCentre": "",
          "Requisitioner": "",
          "SerialNumber": "",
          "Signatory": "",
          "SOLine": "",
          "SONumber": "",
          "StkCond": "",
          "Sub": "",
          "SubCode": "",
          "Subfeature": "",
          "WBS": "",
          "WellFacility": "100-02-14-026-19W3-00",
          "WONumber": "",
          "WorkOrderedBy": "",
          "EDIZip4": ""
        }
      }
    ]
  }
}
